app/controllers/articles_controller.rb

  def index
    @articles = Article.find(:all, :include => [:newspaper], :order => "printed_date DESC")
---
SELECT * FROM "newspapers" WHERE ("newspapers"."id" = 10)