app/controllers/articles_controller.rb

  def index

    if params[:q] == "" || params[:q] == nil
      @articles = Article.all(:include => [:newspaper], :order => "printed_date DESC")
---
SELECT * FROM "articles" ORDER BY printed_date DESC

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 10)

  def new
    @article = Article.new
    @newspapers = Newspaper.all
---
SELECT * FROM "newspapers"

  def edit
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("newspaper_id", "printed_date", "updated_at", "title", "url", "content", "created_at") VALUES(NULL, '2009-10-29 07:24:00.000000', '2009-10-31 07:09:57.738755', E'Weis Updates Injuries &amp; More', E'http://www.irishsportsdaily.com/football/1189-weis-updates-injuries-a-more', E'On Thursday, Charlie Weis said that a number of his players will be game-time decisions on Saturday night against Washington State.

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "newspaper_id" = 10, "updated_at" = '2009-10-31 07:22:30.627500' WHERE "id" = 1