app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def index
    @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 1))
---
  def show
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def new
    @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "commenter") VALUES('2010-09-04 15:27:26.147696', 'MARK-HOLTONs-MacBook-Pro:markholton holtonma$ sudo su postgres -c ''/opt/local/lib/postgresql83/bin/postgres -D /opt/local/var/db/postgresql83/MarkHolton_development''
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save