app/controllers/home_controller.rb

  def index
    @posts = Post.find(:all, :include => [:comments], :order => 'posts.updated_at DESC')
    @news = Newspaper.find(:all, :include => [:articles], :order => "articles.printed_date DESC")
---
SELECT "comments".* FROM "comments" WHERE ("comments".post_id IN (6,5,4,3,2,1))
SELECT "articles".* FROM "articles" WHERE ("articles".newspaper_id IN (1,2,3,4,5,6,7,8,9,10))