app/controllers/newspapers_controller.rb

SELECT * FROM "newspapers"
---
  def index
    @newspapers = Newspaper.all

SELECT * FROM "newspapers" WHERE ("newspapers"."id" = 1)
---
  def show
    @newspaper = Newspaper.find(params[:id])

SELECT * FROM "newspapers" WHERE ("newspapers"."id" = 1)
---
  def edit
    @newspaper = Newspaper.find(params[:id])

INSERT INTO "newspapers" ("name", "updated_at", "url", "created_at") VALUES(E'Chicago Tribune', '2009-10-31 06:46:41.419686', E'http://chicagotribune.com', '2009-10-31 06:46:41.419686') RETURNING "id"
---
  def create
    @newspaper = Newspaper.new(params[:newspaper])

    respond_to do |format|
      if @newspaper.save

SELECT * FROM "newspapers" WHERE ("newspapers"."id" = 1)
UPDATE "newspapers" SET "ranking" = 1, "updated_at" = '2009-10-31 06:51:25.638164' WHERE "id" = 1
---
  def update
    @newspaper = Newspaper.find(params[:id])

    respond_to do |format|
      if @newspaper.update_attributes(params[:newspaper])