app/controllers/posts_controller.rb

SELECT * FROM "posts" ORDER BY updated_at DESC
---
  def index
    @posts = Post.all(:order => 'updated_at DESC')

SELECT * FROM "newspapers"
---
  def edit
    @newspapers = Newspaper.all

INSERT INTO "posts" ("name", "created_at", "title", "updated_at", "content") VALUES('hello world', '2010-09-04 15:23:26.313559', 'this is first post', '2010-09-04 15:23:26.313559', 'sudo mkdir -p /opt/local/var/db/postgresql83/eyeonmajors_development sudo chown postgres:postgres /opt/local/var/db/postgresql83/eyeonmajors_development sudo su postgres -c ''/opt/local/lib/postgresql83/bin/initdb -D /opt/local/var/db/postgresql83/eyeonmajors_development''
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = E'asd;lfj;alsdfja;lsdkfjasdasdf', "updated_at" = '2009-10-31 01:39:25.118284' WHERE "id" = 2
---
  def update

    respond_to do |format|
      if @post.update_attributes(params[:post])

DELETE FROM "posts" WHERE "id" = 2
---
  def destroy
    @post.destroy

SELECT * FROM "posts" WHERE ("posts"."id" = 2)
---
    def find_post
      @post = Post.find(params[:id])